/**SPA数据库2.0**/
SET NAMES UTF8;
DROP DATABASE IF EXISTS spa;
CREATE DATABASE spa CHARSET=UTF8;
USE spa;
/**会员表member**/
CREATE TABLE member(
	mid INT PRIMARY KEY AUTO_INCREMENT,		#会员id（自增）
	mname VARCHAR(16),				#会员名
	gender BOOL,					#会员性别 1-->男 0-->女
	phone CHAR(11),					#联系电话
	level BOOL,						#级别  1->高级员   0->普通会员
	money DECIMAL(10,2),			#余额
	core  SMALLINT,                  #积分
	count  SMALLINT                 #消费次数
);
INSERT INTO member VALUES
(1001,'lucy',1,'15057489986',0,'1500','30','3'),
(1002,'tom',0,'13257489986',0,'2500','66','2'),
(1003,'jerry',1,'17757489986',0,'1320','30','4'),
(1004,'kaier',0,'17754569986',1,'3212','57','7'),
(1005,'blook',0,'13223489986',1,'2300','60','9'),
(1006,'jerry',1,'15057489986',0,'1500','88','4'),
(1007,'wang',0,'15057489986',1,'2312','33','5'),
(1008,'zhao',0,'15057489986',0,'1500','34','3'),
(1009,'qian',0,'15057489986',0,'1211','23','2'),
(10010,'shun',1,'17700489986',0,'121','45','6'),
(10011,'han',1,'13257476986',1,'1532','78','8'),
(10012,'fhan',0,'13257476986',0,'1532','78','2'),
(10013,'gan',0,'13257476986',0,'1222','78','4'),
(10014,'jan',0,'13257646986',0,'1532','78','1'),
(10015,'ad',0,'15237476986',1,'100','78','5'),
(10016,'dag',0,'13257476986',0,'236','78','2'),
(10017,'adg',0,'17757476986',0,'1532','78','1'),
(10018,'jhk',0,'13257476986',0,'532','78','3'),
(10019,'wty',1,'17757476986',0,'132','78','2'),
(10020,'fgh',0,'13257476986',0,'153','78','1');

--创建用户表
/**用户表**/
CREATE TABLE user(
	uid INT PRIMARY KEY AUTO_INCREMENT,		#用户id（自增）
	uname VARCHAR(16),				#用户名
	password VARCHAR(32)				#用户密码
);
INSERT INTO user VALUES
(1,'admin',md5('123456'));
-- 创建商品表
CREATE TABLE goods (
  id INT PRIMARY KEY AUTO_INCREMENT,
  pic VARCHAR(100),
  title VARCHAR(200),
  classify VARCHAR(20),
  des VARCHAR(500),
  price DECIMAL(10,2),
  number INT );

INSERT INTO goods VALUES
 (1,'images/goods/mei/mei1.jpg','化妆品 膏 霜 乳 液 护肤 美容产品','美容','对环境干燥、季节更变等自然因素造成的皮肤干燥，尤其是因皮肤老化造成的胶原蛋白、透明质酸逐渐流失，凝水力下降、粗糙、紧绷、干纹等肌肤问题，运用精准的科学力量，补充复配多肽及透明质酸、丝素肽等高效能成分，深层滋养，改善肌肤干燥、粗糙状态，持久保湿，祛除皱纹，让肌肤丰润紧实有弹性。',380,150),
 (2,'images/goods/mei/mei2.jpg','眼部提拉精致淡化细纹3d补水保湿','美容','含99.99纯金箔成分，经过纳米技术处理，能被肌肤吸收，将天ran矿物质分子直接渗透肌肤底层、活化肌肤、并将老化因子和肌肤杂质带离，加强皮肤的更新能力，抵抗造成肌肤衰老现象的自由基，祛黄、延缓老化、延缓皮肤细胞的年龄。',120,320),

 (3,'images/goods/mei/mei3.jpg','暨大浅导美塑创科多肽祛黄保湿活肤弹力紧致提升','美容','对环境干燥、季节更变等自然因素造成的皮肤干燥，尤其是因皮肤老化造成的胶原蛋白、透明质酸逐渐流失，凝水力下降、粗糙、紧绷、干纹等肌肤问题，运用精准的科学力量，补充复配多肽及透明质酸、丝素肽等高效能成分，深层滋养，改善肌肤干燥、粗糙状态，持久保湿，祛除皱纹，让肌肤丰润紧实有弹性。',145,100),

 (4,'images/goods/mei/mei4.jpg','邦美施复合维生素EC霜冬季补水保湿润肤乳液','美容','本品蕴含维生素E等多种维生素以及人参等植物提取精华，本厂做医院的，所以不含市面上常规保湿霜的化学香精，真正的是纯天然，滋养保护肌肤，改善肌肤干燥、老化、色素沉积等现象，令肌肤紧致、光滑。全身都可涂抹哦，滋润型。',150,80),

 (5,'images/goods/mei/mei5.jpg','春夏复活草保湿补水护肤套装张艺兴补水保湿乳液精','美容','补充复配多肽及透明质酸、丝素肽等高效能成分，深层滋养，改善肌肤干燥、粗糙状态，持久保湿，祛除皱纹，让肌肤丰润紧实有弹性。',230,120),

 (6,'images/goods/mei/mei6.jpg','原生欧芙兰超微水化妆品护肤品套装盒','美容','对环境干燥、季节更变等自然因素造成的皮肤干燥，尤其是因皮肤老化造成的胶原蛋白、透明质酸逐渐流失，凝水力下降、粗糙、紧绷、干纹等肌肤问题',380,80),

 (7,'images/goods/mei/mei7.jpg','爱奴雅专柜正品9系无添加冰膜','美容','渗透肌肤底层、活化肌肤、并将老化因子和肌肤杂质带离，加强皮肤的更新能力，抵抗造成肌肤衰老现象的自由基，祛黄、延缓老化、延缓皮肤细胞的年龄',60,130);




